Update system architecture
